Revit 2024 API
BuiltInFailures.ElectricalFailures.ReplaceSpareSpaceOnPanelBoard Property
 Need to replace spare or space on panelboard.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ReplaceSpareSpaceOnPanelBoard { get; }
Visual Basic
Public Shared ReadOnly Property ReplaceSpareSpaceOnPanelBoard As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ReplaceSpareSpaceOnPanelBoard {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace